cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/php'

brew 'coreutils'

# Install xquartz first because some things depend on it
cask 'xquartz'

brew 'ack'
brew 'autoconf'
brew 'automake'
brew 'cabal-install'
brew 'chromaprint'
brew 'cmatrix'
brew 'composer'
brew 'curl'
brew 'ddate'
brew 'fftw'
brew 'fluidsynth'
brew 'go'
brew 'git', args: ['without-completions']
brew 'gnupg'
brew 'gpg-agent'
brew 'pinentry-mac'
brew 'grc'
brew 'gsl'
brew 'imagemagick'
brew 'jp2a'
brew 'lame'
brew 'libcaca', args: ['with-imlib2']
brew 'libquicktime'
brew 'librsvg'
brew 'libtool'
brew 'libyaml'
brew 'micro'
brew 'mysql'
brew 'node'
brew 'openssl'
brew 'optipng'
brew 'php@7.1'
brew 'phpunit'
brew 'postgresql'
brew 'pkg-config'
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'speex'
brew 'sqlite3'
brew 'tag'
brew 'tree'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'

cask '1password'
cask 'a-better-finder-rename'
cask 'alfred'
cask 'appcleaner'
cask 'ascension'
cask 'atom'
cask 'audio-hijack'
cask 'bartender'
cask 'calibre'
cask 'cloud'
cask 'colloquy'
cask 'crashplan'
cask 'dash'
cask 'dropbox'
cask 'firefox'
cask 'dupeguru'
cask 'fantastical'
cask 'fastscripts'
cask 'flux'
cask 'gimp'
cask 'google-chrome'
cask 'istat-menus'
cask 'iterm2'
cask 'kaleidoscope'
cask 'kid3'
cask 'little-snitch'
cask 'livereload'
cask 'marked'
cask 'moom'
cask 'nvalt'
cask 'private-internet-access'
cask 'screenhero'
cask 'sequel-pro'
cask 'skype'
cask 'spotify'
cask 'swinsian'
cask 'the-unarchiver'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
