cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'coreutils'
brew 'gnu-sed'

# Install xquartz first because some things depend on it
cask 'xquartz'

brew 'ack'
brew 'autoconf'
brew 'automake'
brew 'cabal-install'
brew 'chromaprint'
brew 'cmatrix'
brew 'composer'
brew 'curl'
brew 'ddate'
# brew 'fftw'
brew 'flac'
# brew 'fluidsynth'
brew 'git', args: ['without-completions']
brew 'gnupg'
brew 'gpg-agent'
brew 'graphicsmagick'
brew 'grc'
brew 'gsl'
brew 'imagemagick'
brew 'jp2a'
brew 'lame'
brew 'libcaca', args: ['with-imlib2']
brew 'libquicktime'
brew 'librsvg'
brew 'libtool'
brew 'libyaml'
brew 'micro'
brew 'mktorrent'
brew 'mysql'
brew 'node'
brew 'openssl'
brew 'optipng'
brew 'php@7.1', args: ['with-pear']
brew 'phpunit'
brew 'pinentry-mac'
brew 'postgresql'
brew 'pkg-config'
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'rclone'
brew 'scmpuff'
brew 'shellcheck'
brew 'speex'
brew 'sqlite3'
brew 'tag'
brew 'tree'
brew 'wget'
brew 'whatmp3'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-syntax-highlighting'

# cask '1password'
# cask 'a-better-finder-rename'
# cask 'alfred'
# cask 'appcleaner'
# cask 'ascension'
# cask 'atom'
# cask 'audio-hijack'
# cask 'bartender'
# cask 'calibre'
# cask 'cloud'
# cask 'colloquy'
# cask 'dash'
# cask 'dropbox'
# cask 'firefox'
# cask 'dupeguru'
# cask 'fantastical'
# cask 'fastscripts'
# cask 'flux'
# cask 'gimp'
# cask 'google-chrome'
# cask 'istat-menus'
# cask 'iterm2'
# cask 'kaleidoscope'
# cask 'kid3'
# cask 'little-snitch'
# cask 'livereload'
# cask 'marked'
# cask 'moom'
# cask 'nvalt'
# cask 'private-internet-access'
# cask 'screenhero'
# cask 'sequel-pro'
# cask 'skype'
# cask 'spotify'
# cask 'swinsian'
# cask 'the-unarchiver'
# cask 'transmit'
# cask 'visual-studio-code'
# cask 'vlc'
# cask 'zoomus'

# QuickLook plugins
# https://github.com/sindresorhus/quick-look-plugins
# cask 'qlcolorcode'
# cask 'qlstephen'
# cask 'qlmarkdown'
# cask 'quicklook-json'
# cask 'webpquicklook'
# cask 'suspicious-package'
# cask 'quicklookase'
# cask 'qlvideo'
