cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

brew 'coreutils'
brew 'gnu-sed'

# Install xquartz first because some things depend on it
cask 'xquartz'

brew 'aacgain'
brew 'ack'
brew 'autoconf'
brew 'automake'
brew 'bash-completion'
brew 'bat'
brew 'cabal-install'
brew 'chromaprint'
brew 'cmatrix'
brew 'composer'
brew 'curl'
brew 'ddate'
brew 'direnv'
brew 'ical-buddy'
brew 'exa'
brew 'fish'
brew 'flac'
brew 'hub'
brew 'git'
brew 'gnupg'
brew 'graphicsmagick'
brew 'grc'
brew 'gsl'
brew 'imagemagick'
brew 'jp2a'
brew 'lame'
brew 'libcaca'
brew 'libquicktime'
brew 'librsvg'
brew 'libtool'
brew 'libyaml'
brew 'm-cli'
brew 'micro'
brew 'mktorrent'
brew 'mysql'
brew 'node'
brew 'openssl'
brew 'optipng'
brew 'php'
brew 'phpunit'
brew 'pinentry-mac'
brew 'postgresql'
brew 'pkg-config'
brew 'python2'
brew 'python3'
brew 'rbenv'
brew 'rclone'
brew 'scmpuff'
brew 'shellcheck'
brew 'speex'
brew 'sqlite3'
brew 'tag'
brew 'tree'
brew 'wget'
brew 'whatmp3'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-syntax-highlighting'

# cask '1password'
cask 'a-better-finder-rename'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'appcleaner'
cask 'ascension'
cask 'audio-hijack'
cask 'bartender'
cask 'beatunes'
cask 'bettertouchtool'
cask 'brave-browser'
cask 'calibre'
cask 'caprine'
cask 'cardhop'
cask 'cloudapp'
cask 'colloquy'
cask 'dash'
# Assuming Dropbox is already installed because of its importance
# cask 'dropbox'
cask 'dupeguru'
cask 'fantastical'
cask 'fastscripts'
cask 'finicky'
cask 'google-chrome'
cask 'istat-menus'
cask 'iterm2'
cask 'kaleidoscope'
cask 'keybase'
cask 'keyboard-maestro'
cask 'kid3'
cask 'livereload'
cask 'mailplane'
cask 'marked'
cask 'moom'
cask 'muzzle'
cask 'multifirefox'
cask 'noteplan'
cask 'omnifocus'
cask 'rescuetime'
cask 'rocket'
cask 'script-debugger'
cask 'soundsource'
cask 'textexpander'
cask 'transmit'
cask 'usb-overdrive'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoomus'

# QuickLook plugins
# https://github.com/sindresorhus/quick-look-plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'

# Fonts
cask 'font-anonymice-powerline'
cask 'font-consolas-for-powerline'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-fira-code'
cask 'font-fira-mono-for-powerline'
cask 'font-fira-sans'
cask 'font-hack'
cask 'font-inconsolata-dz-for-powerline'
cask 'font-inconsolata-for-powerline'
cask 'font-inconsolata-for-powerline-bold'
cask 'font-inconsolata-g-for-powerline'
cask 'font-liberation-mono-for-powerline'
cask 'font-menlo-for-powerline'
cask 'font-meslo-for-powerline'
cask 'font-monofur-for-powerline'
cask 'font-noto-mono-for-powerline'
cask 'font-powerline-symbols'
cask 'font-roboto-mono-for-powerline'
cask 'font-source-code-pro-for-powerline'
cask 'font-ubuntu-mono-derivative-powerline'
